src/InformationRegisters/ar_Запуски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_Запуски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_СтатусЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АгентРеф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтартовалВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершенВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Триггер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПользовательРеф</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВыход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтоимостьРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ШаговВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РодительскийRunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_StateSnapshot</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_LastHeartbeat</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПрофильЗапуска</Name>
					<Comment>Профиль запуска (CONS-01), определивший ответственного и область данных этого запуска. Пустая ссылка — профиль не указан (обратная совместимость, CONS-02).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_ПрофилиЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПопытокВозобновления</Name>
					<Comment>Счётчик повторов техсбоя (§3.5) и предохранитель третьего слоя детекции прогресса — потолок 10 продолжений (§3.3, CONS-11). Заполняется ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПродолженийСделано</Name>
					<Comment>CONS-11: счётчик фактических продолжений цикла по вердикту Продолжить надзора (§3.3) — предохранитель слоя 3, потолок 10. НЕ путать с ar_ПопытокВозобновления (CONS-09, счётчик техповторов, потолок 3) — разные счётчики по решению аналитика/оркестратора, во избежание рассинхрона двух независимых механизмов. Не сбрасывается при автовозобновлении техсбоя (ar_Планировщик.ОбработатьАвтовозобновление).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнееРешениеНадзора</Name>
					<Comment>Каноническое имя значения ar_ВердиктНадзора (или пусто, если надзор ещё не вызывался) — хранится строкой, а не ссылкой на перечисление, чтобы консоль показывала решение без join (план §5.1). Заполняется ar_Надзор (CONS-10).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтпечатокШага</Name>
					<Comment>Хэш «имя tool + хэш аргументов + хэш результата» последнего шага — основа result-aware детекции застревания (§3.3, CONS-11). 64 символа — под hex SHA-256.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПовторитьПосле</Name>
					<Comment>Момент следующей попытки при временном техсбое (сеть, таймаут, 429/5xx); пусто — повтор не запланирован (§3.5). Читает и пишет ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТекущийЭтап</Name>
					<Comment>PLAN-01: название текущего этапа плана (заголовок пункта) — для быстрого отображения без join (план §5.1). Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.ТекущийПункт (PLAN-02, пока не реализован). Полный план не хранится в регистре — восстанавливается из последнего события PlanUpdated в ar_СобытияЗапуска. Пусто для запусков без плана.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповВсего</Name>
					<Comment>PLAN-01: общее количество этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповЗакрыто</Name>
					<Comment>PLAN-01: количество завершённых этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжидаетСобытия</Name>
					<Comment>PLAN-10: JSON-строка вида {\"object_type\": \"Справочник.Контрагенты\", \"filter\": {\"Наименование\": \"ООО Ромашка\"}} - тип объекта + плоский фильтр без операторов, по аналогии с ar_ОбработчикПодписок.ГорячиеТипы/ПроверитьФильтр. Заполняется ar_RuntimeЦикл/ar_ИнструментыПлан при вызове tool wait_for_event(object_type, filter, deadline_hours) (PLAN-11, пока не реализован). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжиданиеДо</Name>
					<Comment>PLAN-10: дедлайн ожидания события, DateTime (точность до секунды - deadline_hours в часах, PLAN-11). Заполняется ar_RuntimeЦикл при вызове tool wait_for_event как ТекущаяДата() + deadline_hours часов (PLAN-11, пока не реализован). Сравнивается с ТекущаяДата() в регламентном задании проверки дедлайна (PLAN-13). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_RunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ar_ОчередьApproval.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ОчередьApproval</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_RunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Sequence</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ActionPayloadJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОбоснованиеLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СозданоВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РешеноВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РешилПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_IdempotencyKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_ApprovalId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ar_КонсольДанные/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_КонсольДанные (CONS-03).
//
// Модуль-поставщик данных для будущей формы консоли агентов (CONS-04, не в
// объёме этой задачи) - сама форма здесь не пишется.
//
// Четыре обязанности:
//  1. СписокЗапусков       - список запусков одним запросом (ПЕРВЫЕ 200).
//  2. СводныеСчётчики      - агрегат по ar_Статус, отдельным запросом.
//  3. СчётчикОжидающихApproval - агрегат по ar_ОчередьApproval, группировка по ar_RunId.
//  4. ЗдоровьеПланировщика - тонкая обёртка над ar_Scheduler.ДиагностикаПланировщика().
//
// ЯДРО БЕЗОПАСНОСТИ ЗАДАЧИ: фильтр по ответственному встроен ВНУТРИ модуля,
// в приватную процедуру ПрименитьФильтрПоОтветственному. Ни одна
// экспортная функция НЕ принимает параметр, отключающий или подменяющий
// фильтр (ПоказатьВсе/БезФильтра/Пользователь и т.п.) - единственный
// легальный способ увидеть все запуски - быть полноправным пользователем
// (Пользователи.ЭтоПолноправныйПользователь(), тот же приём, что и в
// ar_ToolDispatcher, см. обоснование там же: перебор ролей, назначенных
// напрямую объекту ПользователиИнформационнойБазы, не отразил бы фактически
// действующие в сеансе права).
// [Реф: БСП/Пользователи.ЭтоПолноправныйПользователь]
//
// "Свой" запуск определяется через профиль (CONS-01/02), а не напрямую через
// ar_АгентРеф.ar_Пользователь:
//  - ar_ПрофильЗапуска заполнен -> пользователь должен быть в ТЧ
//    ar_ПрофилиЗапуска.ar_Ответственные этого профиля (любая роль);
//  - ar_ПрофильЗапуска пуст -> пользователь должен быть равен ar_Агенты.ar_Пользователь
//    агента запуска (текущее поведение для агентов без профиля, CONS-02);
//  - ar_АгентРеф тоже пуст (запуск без агента, СтартоватьВФонеБезАгента,
//    UI-22) -> видимость по ar_ПользовательРеф самого запуска - единственная
//    привязка к человеку, которая есть у безагентного запуска.
//
// Множество доступных RunId вычисляется ДО основного запроса компактными
// вспомогательными запросами (доступные профили + доступные агенты) и
// переиспользуется списком, сводкой и approval-счётчиком - без повторного
// вызова ar_ПрофилиЗапуска.Ответственные в цикле по строкам (N+1) и без ИЛИ в
// секции ГДЕ одного запроса (BSL LS: LogicalOrInTheWhereSectionOfQuery) -
// вместо этого два текста запроса, объединённые ОБЪЕДИНИТЬ ВСЕ, как уже
// принято в проекте (ar_ПрофилиЗапуска.Ответственные/ПрофилиАгента).
//
// ar_СобытияЗапуска/ar_ДействияАгента/ar_МетрикиLLM не участвуют ни в одном
// запросе модуля (жёсткое ограничение задачи).
//
// Свойства модуля: Сервер, без вызова с клиента, Привилегированный = Ложь.
// Запрещено: Выполнить(), Вычислить(), УстановитьПривилегированныйРежим.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обязанность 1. Список запусков одним запросом (константное число обращений
// к БД, не зависящее от количества строк результата).
//
// Параметры:
//  Отбор - Структура - необязательные поля отбора (все - Неопределено по умолчанию):
//    * Режим       - Строка - "Работают" / "ТребуютВнимания" / "ЗаПериод" / Неопределено (все режимы).
//    * ПериодС     - Дата - начало периода отбора по ar_СтартовалВ. Применяется ВСЕГДА,
//      когда задан (не только при Режим = "ЗаПериод") - CONS-04, панель отбора
//      комбинирует период с любым быстрым режимом.
//    * ПериодПо    - Дата - конец периода отбора по ar_СтартовалВ (см. ПериодС).
//    * АгентРеф    - СправочникСсылка.ar_Агенты - фильтр по конкретному агенту.
//    * СтатусыРеф  - Массив из ПеречислениеСсылка.ar_СтатусЗапуска - множественный
//      фильтр по статусу (CONS-04, план §2.2). Пустой массив трактуется как
//      "условие не наложено" (не как "ничего не показывать").
//    * ПользовательРеф - СправочникСсылка.Пользователи - фильтр по ответственному
//      (ar_ПользовательРеф запуска) - CONS-04.
//    * Триггер     - Строка - точное совпадение с ar_Триггер (значения manual/
//      schedule/mention/subscription/http/dialog) - CONS-04.
//    * ТолькоСОшибками  - Булево - Истина ограничивает выборку статусом Failed - CONS-04.
//    * ТолькоАвтономные - Булево - Истина ограничивает выборку агентами с
//      ar_РежимАвтономии = Autonomous (JOIN на Справочник.ar_Агенты, уже
//      присутствующий в тексте запроса) - CONS-04.
//   Если параметр не передан - Неопределено, соответствующее условие не накладывается.
//
// Возвращаемое значение:
//  Массив из Структура - {
//    RunId               - Строка,
//    Статус              - ПеречислениеСсылка.ar_СтатусЗапуска,
//    АгентРеф            - СправочникСсылка.ar_Агенты,
//    ПредставлениеАгента - Строка,
//    ПользовательРеф     - СправочникСсылка.Пользователи,
//    ПредставлениеПользователя - Строка,
//    СтартовалВ          - Дата,
//    ЗавершенВ           - Дата,
//    Триггер             - Строка,
//    ШаговВсего          - Число,
//    ТокеновВход         - Число,
//    ТокеновВыход        - Число,
//    СтоимостьРуб        - Число,
//    LastHeartbeat       - Дата,
//    РодительскийRunId   - Строка,
//    ЕстьСнимок          - Булево - признак наличия ar_StateSnapshot (НЕ само значение)
//  }, не более 200 строк, упорядочено по СтартовалВ УБЫВ.
//
Функция СписокЗапусков(Знач Отбор = Неопределено) Экспорт

	Если Отбор = Неопределено Тогда
		Отбор = Новый Структура;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 200
		|	Запуски.ar_RunId КАК RunId,
		|	Запуски.ar_Статус КАК Статус,
		|	Запуски.ar_АгентРеф КАК АгентРеф,
		|	Агенты.Наименование КАК ПредставлениеАгента,
		|	Запуски.ar_ПользовательРеф КАК ПользовательРеф,
		|	Пользователи.Наименование КАК ПредставлениеПользователя,
		|	Запуски.ar_СтартовалВ КАК СтартовалВ,
		|	Запуски.ar_ЗавершенВ КАК ЗавершенВ,
		|	Запуски.ar_Триггер КАК Триггер,
		|	Запуски.ar_ШаговВсего КАК ШаговВсего,
		|	Запуски.ar_ТокеновВход КАК ТокеновВход,
		|	Запуски.ar_ТокеновВыход КАК ТокеновВыход,
		|	Запуски.ar_СтоимостьРуб КАК СтоимостьРуб,
		|	Запуски.ar_LastHeartbeat КАК LastHeartbeat,
		|	Запуски.ar_РодительскийRunId КАК РодительскийRunId,
		|	Запуски.ar_StateSnapshot ЕСТЬ НЕ NULL КАК ЕстьСнимок
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ar_Агенты КАК Агенты
		|		ПО Запуски.ar_АгентРеф = Агенты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Запуски.ar_ПользовательРеф = Пользователи.Ссылка
		|ГДЕ
		|	ИСТИНА
		|	//ДОП_УСЛОВИЯ
		|УПОРЯДОЧИТЬ ПО
		|	Запуски.ar_СтартовалВ УБЫВ";

	ПрименитьФильтрПоОтветственному(Запрос);
	ДобавитьУсловияОтбора(Запрос, Отбор);

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура;
		Строка.Вставить("RunId", СокрЛП(Выборка.RunId));
		Строка.Вставить("Статус", Выборка.Статус);
		Строка.Вставить("АгентРеф", Выборка.АгентРеф);
		Строка.Вставить("ПредставлениеАгента", СокрЛП(Строка(Выборка.ПредставлениеАгента)));
		Строка.Вставить("ПользовательРеф", Выборка.ПользовательРеф);
		Строка.Вставить("ПредставлениеПользователя", СокрЛП(Строка(Выборка.ПредставлениеПользователя)));
		Строка.Вставить("СтартовалВ", Выборка.СтартовалВ);
		Строка.Вставить("ЗавершенВ", Выборка.ЗавершенВ);
		Строка.Вставить("Триггер", СокрЛП(Выборка.Триггер));
		Строка.Вставить("ШаговВсего", Выборка.ШаговВсего);
		Строка.Вставить("ТокеновВход", Выборка.ТокеновВход);
		Строка.Вставить("ТокеновВыход", Выборка.ТокеновВыход);
		Строка.Вставить("СтоимостьРуб", Выборка.СтоимостьРуб);
		Строка.Вставить("LastHeartbeat", Выборка.LastHeartbeat);
		Строка.Вставить("РодительскийRunId", СокрЛП(Выборка.РодительскийRunId));
		Строка.Вставить("ЕстьСнимок", Выборка.ЕстьСнимок);
		Результат.Добавить(Строка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Обязанность 3. Сводные счётчики по ar_Статус, отдельным агрегирующим
// запросом (НЕ подсчёт по результату функции списка запусков - тот
// ограничен ПЕРВЫЕ 200). Фильтр по ответственному идентичен фильтру списка
// (тот же приватный источник доступных RunId).
//
// Параметры:
//  Отбор - Структура - те же поля отбора, что принимает функция списка
//   запусков (Режим/ПериодС/ПериодПо/АгентРеф/СтатусыРеф/ПользовательРеф/
//   Триггер/ТолькоСОшибками/ТолькоАвтономные), чтобы сводка соответствовала
//   текущему режиму просмотра формы (CONS-04). "ТолькоАвтономные" требует
//   JOIN на Справочник.ar_Агенты - добавлен в текст запроса этой функции
//   специально для CONS-04 (изначально в СводныеСчётчики JOIN отсутствовал).
//
// Возвращаемое значение:
//  Массив из Структура - {Статус (ПеречислениеСсылка.ar_СтатусЗапуска), Количество (Число)}.
//
Функция СводныеСчётчики(Знач Отбор = Неопределено) Экспорт

	Если Отбор = Неопределено Тогда
		Отбор = Новый Структура;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Запуски.ar_Статус КАК Статус,
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ar_Агенты КАК Агенты
		|		ПО Запуски.ar_АгентРеф = Агенты.Ссылка
		|ГДЕ
		|	ИСТИНА
		|	//ДОП_УСЛОВИЯ
		|СГРУППИРОВАТЬ ПО
		|	Запуски.ar_Статус";

	ПрименитьФильтрПоОтветственному(Запрос);
	ДобавитьУсловияОтбора(Запрос, Отбор);

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура;
		Строка.Вставить("Статус", Выборка.Статус);
		Строка.Вставить("Количество", Выборка.Количество);
		Результат.Добавить(Строка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Обязанность 4. Счётчик ожидающих approval, агрегирующим запросом к
// ar_ОчередьApproval, группировка по ar_RunId, ограничен статусом "pending".
// Видимость RunId - тот же фильтр по ответственному (соединение с
// ar_Запуски внутри этого же запроса - без отдельного прохода за списком
// RunId).
//
// Возвращаемое значение:
//  Массив из Структура - {RunId (Строка), Количество (Число)}. Потребитель
//   считает и общий счётчик (сумма по всем строкам), и признак для
//   конкретной строки списка - из одного и того же результата.
//
Функция СчётчикОжидающихApproval() Экспорт

	// Левое соединение с ar_Запуски по ar_RunId - фильтр по ответственному
	// применяется к соединённой таблице Запуски (то же имя алиаса, что и в
	// ПрименитьФильтрПоОтветственному), без отдельного прохода по
	// ar_Запуски только за списком RunId (рекомендация спеки, «Обязанность 4»).
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Очередь.ar_RunId КАК RunId,
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	РегистрСведений.ar_ОчередьApproval КАК Очередь
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ar_Запуски КАК Запуски
		|		ПО Очередь.ar_RunId = Запуски.ar_RunId
		|ГДЕ
		|	Очередь.ar_Статус = ""pending""
		|	//ДОП_УСЛОВИЯ
		|СГРУППИРОВАТЬ ПО
		|	Очередь.ar_RunId";

	ПрименитьФильтрПоОтветственному(Запрос);

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура;
		Строка.Вставить("RunId", СокрЛП(Выборка.RunId));
		Строка.Вставить("Количество", Выборка.Количество);
		Результат.Добавить(Строка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Обязанность 5. Здоровье регламентных заданий - тонкая обёртка над уже
// существующей функцией, без переписывания её логики.
//
// Возвращаемое значение:
//  Массив из Структура - см. ar_Scheduler.ДиагностикаПланировщика().
//
Функция ЗдоровьеПланировщика() Экспорт

	Возврат ar_Scheduler.ДиагностикаПланировщика();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Ядро фильтра по ответственному (безопасность задачи, см. заголовок
// модуля). Добавляет условие видимости к тексту запроса, который уже
// содержит алиас "Запуски" на РегистрСведений.ar_Запуски (в секции ГДЕ или в
// левом соединении, см. СчётчикОжидающихApproval) и заканчивается на "ГДЕ
// |	ИСТИНА" - процедура дописывает "И Запуски.ar_RunId В (&ДоступныеЗапуски)"
// либо не добавляет ничего (полноправный пользователь - без ограничения).
//
// Множество доступных RunId вычисляется предварительным компактным запросом
// (константное число обращений к БД, не растёт с числом строк результата
// внешнего запроса) - НЕ вызывает ar_ПрофилиЗапуска.Ответственные в цикле
// (N+1): ТЧ ar_Ответственные читается один раз для всех профилей сразу, где
// ar_Пользователь = ТекущийПользователь.
//
// Параметры:
//  Запрос - Запрос - объект запроса с алиасом "Запуски" на ar_Запуски и
//   текстом, заканчивающимся на "ГДЕ |	ИСТИНА" (плейсхолдер вместо
//   собственного условия - упрощает дозапись через "И").
//
Процедура ПрименитьФильтрПоОтветственному(Запрос)

	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;

	ТекущийПользователь = Пользователи.ТекущийПользователь();

	ЗапросДоступных = Новый Запрос;
	ЗапросДоступных.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	// Два текста запроса, объединённые ОБЪЕДИНИТЬ ВСЕ, вместо ИЛИ в секции
	// ГДЕ (BSL LS: LogicalOrInTheWhereSectionOfQuery) - конвенция уже принята
	// в проекте, см. ar_ПрофилиЗапуска.Ответственные/ПрофилиАгента.
	ЗапросДоступных.Текст =
		"ВЫБРАТЬ
		|	Запуски.ar_RunId КАК RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_ПрофильЗапуска <> ЗНАЧЕНИЕ(Справочник.ar_ПрофилиЗапуска.ПустаяСсылка)
		|	И Запуски.ar_ПрофильЗапуска В
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Ответственные.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.ar_ПрофилиЗапуска.ar_Ответственные КАК Ответственные
		|		ГДЕ
		|			Ответственные.ar_Пользователь = &ТекущийПользователь)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Запуски.ar_RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_ПрофильЗапуска = ЗНАЧЕНИЕ(Справочник.ar_ПрофилиЗапуска.ПустаяСсылка)
		|	И Запуски.ar_АгентРеф <> ЗНАЧЕНИЕ(Справочник.ar_Агенты.ПустаяСсылка)
		|	И Запуски.ar_АгентРеф В
		|		(ВЫБРАТЬ
		|			Агенты.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.ar_Агенты КАК Агенты
		|		ГДЕ
		|			Агенты.ar_Пользователь = &ТекущийПользователь)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Запуски.ar_RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_ПрофильЗапуска = ЗНАЧЕНИЕ(Справочник.ar_ПрофилиЗапуска.ПустаяСсылка)
		|	И Запуски.ar_АгентРеф = ЗНАЧЕНИЕ(Справочник.ar_Агенты.ПустаяСсылка)
		|	И Запуски.ar_ПользовательРеф = &ТекущийПользователь";

	ДоступныеЗапуски = Новый Массив;
	Выборка = ЗапросДоступных.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДоступныеЗапуски.Добавить(СокрЛП(Выборка.RunId));
	КонецЦикла;

	ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_RunId В (&ДоступныеЗапуски)");
	Запрос.УстановитьПараметр("ДоступныеЗапуски", ДоступныеЗапуски);

КонецПроцедуры

// Уникальный текстовый маркер, вставляемый в текст запроса на месте будущих
// дополнительных условий (см. ВставитьДополнительноеУсловие). Нужен, чтобы
// УПОРЯДОЧИТЬ ПО / СГРУППИРОВАТЬ ПО присутствовали в тексте запроса сразу
// (BSL LS: SelectTopWithoutOrderBy требует видеть сортировку статически, а
// не дописанной конкатенацией после того, как линтер уже проверил текст).
//
// Возвращаемое значение:
//  Строка - текст-маркер, синтаксически нейтральный для языка запросов
//   (пустой комментарий), не влияющий на результат, если условия не добавлены.
//
Функция МаркерДополнительныхУсловий()

	Возврат "//ДОП_УСЛОВИЯ";

КонецФункции

// Вставляет дополнительное условие в текст запроса на место маркера
// (см. МаркерДополнительныхУсловий), оставляя маркер для последующих вставок
// (несколько условий добавляются последовательно, каждое - перед тем же
// маркером).
//
// Параметры:
//  Запрос  - Запрос - текст которого содержит МаркерДополнительныхУсловий().
//  Условие - Строка - текст условия (например, "И Запуски.ar_Статус = &СтатусРеф"),
//   без собственных значений - параметры устанавливаются вызывающим кодом
//   отдельно через УстановитьПараметр.
//
Процедура ВставитьДополнительноеУсловие(Запрос, Знач Условие)

	Маркер = МаркерДополнительныхУсловий();
	ЗаменаМаркера = Условие + "
		|	" + Маркер;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, Маркер, ЗаменаМаркера);

КонецПроцедуры

// Часть ДобавитьУсловияОтбора, вынесенная отдельно ради когнитивной сложности
// (BSL LS: CognitiveComplexity) - режим быстрого просмотра и период (CONS-04:
// период больше не привязан к Режим = "ЗаПериод", применяется всегда, когда
// задан, независимо от активного быстрого режима - панель отбора плана §2.2
// задаёт период отдельной группой, а не альтернативой быстрым режимам).
//
// Параметры:
//  Запрос - Запрос - см. ДобавитьУсловияОтбора.
//  Отбор  - Структура - см. ДобавитьУсловияОтбора (поля Режим/ПериодС/ПериодПо).
//
Процедура ДобавитьУсловияРежимаИПериода(Запрос, Знач Отбор)

	Режим = Неопределено;
	Если Отбор.Свойство("Режим") Тогда
		Режим = Отбор.Режим;
	КонецЕсли;

	// Независимые (не ИначеЕсли) проверки: значения Режима взаимоисключающие
	// сами по себе (это одна строка), поэтому ветвление не нужно - а
	// Неопределено/неизвестное значение естественным образом не совпадает ни
	// с одним из трёх литералов, и условие по режиму просто не накладывается.
	Если Режим = "Работают" Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_Статус В (&СтатусыРаботают)");
		СтатусыРаботают = Новый Массив;
		СтатусыРаботают.Добавить(Перечисления.ar_СтатусЗапуска.Running);
		СтатусыРаботают.Добавить(Перечисления.ar_СтатусЗапуска.Created);
		Запрос.УстановитьПараметр("СтатусыРаботают", СтатусыРаботают);
	КонецЕсли;

	Если Режим = "ТребуютВнимания" Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_Статус В (&СтатусыТребуютВнимания)");
		СтатусыТребуютВнимания = Новый Массив;
		СтатусыТребуютВнимания.Добавить(Перечисления.ar_СтатусЗапуска.PausedForApproval);
		СтатусыТребуютВнимания.Добавить(Перечисления.ar_СтатусЗапуска.PausedForInput);
		СтатусыТребуютВнимания.Добавить(Перечисления.ar_СтатусЗапуска.Failed);
		СтатусыТребуютВнимания.Добавить(Перечисления.ar_СтатусЗапуска.Interrupted);
		СтатусыТребуютВнимания.Добавить(Перечисления.ar_СтатусЗапуска.MaxStepsReached);
		Запрос.УстановитьПараметр("СтатусыТребуютВнимания", СтатусыТребуютВнимания);
	КонецЕсли;

	ПериодС = Неопределено;
	ПериодПо = Неопределено;
	Отбор.Свойство("ПериодС", ПериодС);
	Отбор.Свойство("ПериодПо", ПериодПо);
	Если ЗначениеЗаполнено(ПериодС) И ЗначениеЗаполнено(ПериодПо) Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_СтартовалВ МЕЖДУ &ПериодС И &ПериодПо");
		Запрос.УстановитьПараметр("ПериодС", ПериодС);
		Запрос.УстановитьПараметр("ПериодПо", ПериодПо);
	КонецЕсли;

КонецПроцедуры

// Достраивает текст запроса дополнительными условиями отбора по структуре
// Отбор (см. СписокЗапусков/СводныеСчётчики). Только параметризованные
// условия через УстановитьПараметр - без Выполнить()/Вычислить() и без
// конкатенации пользовательского ввода в текст запроса.
//
// Параметры:
//  Запрос - Запрос - объект запроса после ПрименитьФильтрПоОтветственному
//   (алиас "Запуски" уже присутствует в тексте, а для ТолькоАвтономные -
//   также алиас "Агенты" на ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ar_Агенты); текст
//   запроса будет дополнен через "И <условие>" (без ИЛИ - режимы задаются
//   отдельными параметрами, каждый - самостоятельное И-условие).
//  Отбор - Структура - поля отбора, см. докстроку СписокЗапусков (Режим/
//   ПериодС/ПериодПо/АгентРеф/СтатусыРеф/ПользовательРеф/Триггер/
//   ТолькоСОшибками/ТолькоАвтономные).
//
Процедура ДобавитьУсловияОтбора(Запрос, Знач Отбор)

	ДобавитьУсловияРежимаИПериода(Запрос, Отбор);

	АгентРеф = Неопределено;
	Если Отбор.Свойство("АгентРеф", АгентРеф) И ЗначениеЗаполнено(АгентРеф) Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_АгентРеф = &АгентРеф");
		Запрос.УстановитьПараметр("АгентРеф", АгентРеф);
	КонецЕсли;

	// CONS-04: множественный выбор статуса (план §2.2) - СтатусыРеф вместо
	// одиночного СтатусРеф. Пустой массив = условие не наложено (не "ничего
	// не показывать") - потребитель отвечает за то, чтобы не передавать сюда
	// пустой массив, если хочет реально отфильтровать "ничего".
	СтатусыРеф = Неопределено;
	Если Отбор.Свойство("СтатусыРеф", СтатусыРеф) И ТипЗнч(СтатусыРеф) = Тип("Массив")
		И СтатусыРеф.Количество() > 0 Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_Статус В (&СтатусыРеф)");
		Запрос.УстановитьПараметр("СтатусыРеф", СтатусыРеф);
	КонецЕсли;

	// CONS-04: фильтр по ответственному пользователю (ar_ПользовательРеф
	// самого запуска - то же поле, что используют безагентные запуски в
	// ПрименитьФильтрПоОтветственному, здесь используется как обычное поле
	// отбора панели, а не как ядро безопасности).
	ПользовательРеф = Неопределено;
	Если Отбор.Свойство("ПользовательРеф", ПользовательРеф) И ЗначениеЗаполнено(ПользовательРеф) Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_ПользовательРеф = &ПользовательРеф");
		Запрос.УстановитьПараметр("ПользовательРеф", ПользовательРеф);
	КонецЕсли;

	// CONS-04: точное совпадение по триггеру (ar_Триггер - произвольная
	// строка, не перечисление; значения manual/schedule/mention/subscription/
	// http/dialog известны заранее, см. докстроку СписокЗапусков).
	Триггер = Неопределено;
	Если Отбор.Свойство("Триггер", Триггер) И ТипЗнч(Триггер) = Тип("Строка")
		И Не ПустаяСтрока(Триггер) Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_Триггер = &Триггер");
		Запрос.УстановитьПараметр("Триггер", Триггер);
	КонецЕсли;

	// CONS-04: "только с ошибками" - Failed конкретно, отдельно от режима
	// "ТребуютВнимания" (тот шире - включает и PausedForApproval/Interrupted/
	// MaxStepsReached, см. докстроку задачи "Расхождение").
	ТолькоСОшибками = Ложь;
	Если Отбор.Свойство("ТолькоСОшибками", ТолькоСОшибками) И ТолькоСОшибками = Истина Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_Статус = &СтатусОшибка");
		Запрос.УстановитьПараметр("СтатусОшибка", Перечисления.ar_СтатусЗапуска.Failed);
	КонецЕсли;

	// CONS-04: "только автономные" - требует ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ar_Агенты
	// с алиасом "Агенты" в тексте запроса (присутствует и в СписокЗапусков, и
	// (после этой задачи) в СводныеСчётчики).
	ТолькоАвтономные = Ложь;
	Если Отбор.Свойство("ТолькоАвтономные", ТолькоАвтономные) И ТолькоАвтономные = Истина Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Агенты.ar_РежимАвтономии = &РежимАвтономный");
		Запрос.УстановитьПараметр("РежимАвтономный", Перечисления.ar_РежимАвтономии.Autonomous);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
